Revit 2027 API
IFCCategoryTemplate.ExportToFile Method
 Export mapping template to a text file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ExportToFile(
	Document document,
	string fileName
)
Public Sub ExportToFile (
	document As Document,
	fileName As String
)
public:
void ExportToFile(
	Document^ document,
	String^ fileName
)
member ExportToFile :
        document : Document *
        fileName : string -> unit
Parameters
document Document
 A Revit document.
fileName String
 A full text file name.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
FileAccessException |  Failed to access the text file.
See Also
Reference
IFCCategoryTemplate Class
Autodesk.Revit.DB Namespace